## Staging: pr_review
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_iam_policy.forms_lambda_parameter_store[0]`                 |
|        | `aws_iam_role_policy_attachment.forms_lambda_parameter_store[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.forms_lambda_parameter_store[0] will be created
  + resource "aws_iam_policy" "forms_lambda_parameter_store" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "formsLambdaParameterStoreRetrieval"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:687401027353:parameter/form-viewer/env"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.forms_lambda_parameter_store[0] will be created
  + resource "aws_iam_role_policy_attachment" "forms_lambda_parameter_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "forms-lambda-client"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.pr_review_repository[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_lambda_parameter_store[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.lambda_client_pr_review[0]"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
